package mainapp;

import java.util.Scanner;

public class DataforGrade {

    // 1. Οι γραμμές αντιπροσωπεύουν τα έτη (από το 2020 έως το 2024)
   public static final int[] Years = {2018,2019,2020, 2021, 2022, 2023, 2024, 2025};
    
    // 2. Οι στήλες αντιπροσωπεύουν τα 10 κριτήρια (με την ίδια σειρά για κάθε έτος)
    // ΣΕΙΡΑ ΚΡΙΤΗΡΙΩΝ:
    // [0] ΑΕΠ, [1] Χρέος, [2] Πρωτ. Πλεόνασμα, [3] ΑΠΕ, [4] Ανακύκλωση, 
    // [5] Ρύποι (Μεταβολή), [6] Gini, [7] Δαπάνες Υγ/Εκπ, [8] Ψυχική Υγεία, [9] Εγκληματικότητα
    public static final double[][] Data = {
        // 2018
        {0.017, 1.864, 0.043, 0.180, 0.182, -0.038, 32.3, 0.098, 0.185, 0.010},
        // 2019
        {0.019, 1.807, 0.035, 0.202, 0.190, -0.040, 33.1, 0.100, 0.190, 0.015},
        // 2020:
        {-0.090, 206.3, -0.074, 0.217, 0.200, -0.085, 33.7, 0.109, 0.220, -0.080}, 
        // 2021:
        {0.084, 194.6, -0.037, 0.220, 0.210, 0.046, 33.5, 0.104, 0.210, 0.020},
        // 2022:
        {0.056, 172.7, -0.001, 0.228, 0.215, 0.035, 33.3, 0.101, 0.205, 0.040},
        // 2023:
        {0.021, 160.3, 0.011, 0.232, 0.218, -0.015, 33.4, 0.101, 0.200, 0.050},
        // 2024:
        {0.028, 161.9, 0.019, 0.234, 0.220, -0.026, 33.5, 0.101, 0.200, 0.060},
        // 2025 (Προβλέψεις Προϋπολογισμού/OECD):
        {0.023, 1.527, 0.025, 0.245, 0.235, -0.030, 33.4, 0.102, 0.195, 0.045}
    };
    // Μέθοδος για πρόσβαση στα δεδομένα
    public static double[] getData(int year) {
        for (int i = 0; i < Years.length; i++) {
            if (Years[i] == year) {
                return Data[i];
            }
        }
        return null;
    }
    public int chooseYear() {
        Scanner scan = new Scanner(System.in);
        boolean flag = true;
        int year;
        do {
        System.out.println("Ποιο έτος θέλετε να χρησιμοποιήσετε");
        year = scan.nextInt();
        if (year > 2025 || year < 2018) {
            System.out.println("Επιλέξτε ένα έτος ανάμεσα στο 2018 και 2025");
        } else {
            flag = false;
        }
        } while (flag);
        //Προειδοποιήσεις στον χρήστη για το 2020 και 2025
        if (year == 2020) {
            System.out.println("Κάποια στοιχεία είναι πολύ εππηρεαμσένα "
                + "από το ξέσπασμα της πανδημίας, όπως ο ρυθμός αύξησης του "
                + "ΑΕΠ και η μεταβολή των ρύπων, οπότε ο τελικός βαθμος "
                + "δεν είναι 100% αξιόπιστος!"
            );
        }
        if (year == 2025) {
            System.out.println("Κάποιες τιμές δεδομένων προέρχονται από"
                + " προβλέψεις. Ενδεχεται να υπάρχουν αποκλίσεις από τα πραγματικά"
            );
        }
        return year;
    }
}