package mainapp;

public class DataforGrade {

    // 1. Οι γραμμές αντιπροσωπεύουν τα έτη (από το 2020 έως το 2024)
   public static final String[] Years = {"2020", "2021", "2022", "2023", "2024"};
    
    // 2. Οι στήλες αντιπροσωπεύουν τα 10 κριτήρια (με την ίδια σειρά για κάθε έτος)
    // ΣΕΙΡΑ ΚΡΙΤΗΡΙΩΝ:
    // [0] ΑΕΠ, [1] Χρέος, [2] Πρωτ. Πλεόνασμα, [3] ΑΠΕ, [4] Ανακύκλωση, 
    // [5] Ρύποι (Μεταβολή), [6] Gini, [7] Δαπάνες Υγ/Εκπ, [8] Ψυχική Υγεία, [9] Εγκληματικότητα
    
    public static final double[][] Data = {
        // 2020: 
        {-9.0, 206.3, -7.4, 21.7, 20.0, -8.5, 33.7, 10.9, 22.0, -8.0}, 
        // 2021:
        {8.4, 194.6, -3.7, 22.0, 21.0, 4.6, 33.5, 10.4, 21.0, 2.0},
        // 2022:
        {5.6, 172.7, -0.1, 22.8, 21.5, 3.5, 33.3, 10.1, 20.5, 4.0},
        // 2023:
        {2.1, 160.3, 1.1, 23.2, 21.8, -1.5, 33.4, 10.1, 20.0, 5.0},
        // 2024:
        {2.8, 161.9, 1.9, 23.4, 22.0, -2.6, 33.5, 10.1, 20.0, 6.0}
    };
    
    // Μέθοδος για πρόσβαση στα δεδομένα
    public static double[] getData(String year) {
        for (int i = 0; i < Years.length; i++) {
            if (Years[i].equals(year)) {
                return Data[i];
            }
        }
        return null;
    }
}