public class GradeChar {

    public void gdpGrowthchar(int g) {
        if (g == 5) {
            System.out.println("Το ΑΕΠ μειώθηκε! Πρέπει να "
                + " γίνουν ενέργειες για την επαναφορά της ανάπτυξής του "
                + " το νέο έτος" 
            );
        } else if (g == 6) {
            System.out.println("Πολύ μικρή αύξηση του ΑΕΠ! Πρέπει την "
            + "επόμενη χρονιά να αυξηθεί ο ρυθμός μεγένθυσης!"
            );
        } else if (g <= 9) {
            System.out.println("Μεγάλη άυξηση του ΑΕΠ! Η εγχώρια οικονομία" 
                + " αναπτύσσεται με γρήγορο ρυθμό. Συγχαρητήρια"
            )
        } else {
            System.out.println("Καλή επίδοση. Το ΑΕΠ παρουσίασε αποδεκτή αύξηση.");
        }
    }
}