public class GradeChar {

    public void gdpGrowthChar(int g) {
        if (g == 5) {
            System.out.println("Το ΑΕΠ μειώθηκε! Πρέπει να "
                + " γίνουν ενέργειες για την επαναφορά της ανάπτυξής του "
                + " το νέο έτος" 
            );
        } else if (g == 6) {
            System.out.println("Πολύ μικρή αύξηση του ΑΕΠ! Πρέπει την "
            + "επόμενη χρονιά να αυξηθεί ο ρυθμός μεγένθυσης!"
            );
        } else if (g >= 9) {
            System.out.println("Μεγάλη άυξηση του ΑΕΠ! Η εγχώρια οικονομία" 
                + " αναπτύσσεται με γρήγορο ρυθμό. Συγχαρητήρια"
            );
        } else {
            System.out.println("Καλή επίδοση. Το ΑΕΠ παρουσίασε αποδεκτή αύξηση.");
        }
    }

    public void surplusChar(int g) {
        if (g == 5) {
            System.out.println("Το πρωτογενές πλεόνασμα έχει αρνηρική τιμή." 
                + " Το κράτος δέν κατάφερε να καλύχει τα έξοδά του με τα έσοδα!"
                + " Πρέπει να γίνει πιο υπεύθυνη κατανομή και διάθεση των "
                + "πόρων την νέα χρονιά!"
            );
        } else if (g == 6) {
            System.out.println("Μικρό πρωτογενές πλεόνασμα. Πρέπει να γίνουν "
                + "ενέργειες για την αύξησή του "
            );
        } else if (g >= 9) {
            System.out.println("Το κράτος κατάφερε να καλύψει τα έξοδά του με "
            +" τα έσοδά του εξαιρούμενων των τόκων πολύ αποδοτικά! " 
                + " Συγχαρητήρια"
            );
        } else {
            System.out.println("Καλή επίδοση. Το κράτος κάλυψε τα έξοδά του"
                + " με τα έσοδα που είχε σε αποδεκτό βαθμό."
            );
        }
    }
    public void giniChar(int g) {
         if (g <= 6) {
            System.out.println("Υπάρχουν μεγάλες εισοδηματικέςσ ανισότητες"
                + " εντός του πλυθησμού! Πρέπει να γίνουν ενέργειες " 
                + "για να κατανεμηθεί πιο δίκαια το συνολικό εισόδημα "
                + "στην κοινωνία!"
                );
        } else if (g >= 9) {
            System.out.println("Οι εισοδηματικές ανισότητες έχουν "
                + "περιοριστεί! Πολύ καλή επίδοση!"
                ); 
        } else {
            System.out.println("Aποδεκτή επίδοση. Οι εισοδηματικές " 
                +"ανισότητες βρίσκονται σε επιτρεπτό επίπεδο."
            );
        }
    }
    public void crimeRateChar(int g) {
        if (g <= 6) {
            System.out.println("Μεγάλη αύξηση της εγκληματικότητας! "
                + "Πρέπει να γίνουν ενέργειες για τον περιορισμό της"
            );
        } else if (g >= 9) {
            System.out.println("H εγκληματικότητα μειώθηκε σημαντικά! "
                + "Πολύ καλή επίδοση. Συγχαρητήρια!"
            );
        } else {
            System.out.println("Οι μεταβολές της εγκληματικότητας βρίσκονται "
               + "εντός των επιτρεπτών ορίων."
            );
        }
    }   
}
