public class GradeChar {

    public void gdpGrowthchar(int g) {
        if (g == 5) {
            System.out.println("Το ΑΕΠ μειώθηκε! Πρέπει να "
                + " γίνουν ενέργειες για την επαναφορά της ανάπτυξής του "
                + " το νέο έτος" 
            );
        } else if (g == 6) {
            System.out.println("Πολύ μικρή αύξηση του ΑΕΠ! Πρέπει την "
            + "επόμενη χρονιά να αυξηθεί ο ρυθμός μεγένθυσης!"
            );
        } else if (g >= 9) {
            System.out.println("Μεγάλη άυξηση του ΑΕΠ! Η εγχώρια οικονομία" 
                + " αναπτύσσεται με γρήγορο ρυθμό. Συγχαρητήρια"
            );
        } else {
            System.out.println("Καλή επίδοση. Το ΑΕΠ παρουσίασε αποδεκτή αύξηση.");
        }
    }

    public void surpluschar(int g) {
        if (g == 5) {
            System.out.println("Το πρωτογενές πλεόνασμα έχει αρνηρική τιμή." 
                + " Το κράτος δέν κατάφερε να καλύχει τα έξοδά του με τα έσοδα!"
                + " Πρέπει να γίνει πιο υπεύθυνη κατανομή και διάθεση των "
                + "πόρων την νέα χρονιά!"
            );
        } else if (g == 6) {
            System.out.println("Μικρό πρωτογενές πλεόνασμα. Πρέπει να γίνουν "
                + "ενέργειες για την αύξησή του "
            );
        } else if (g >= 9) {
            System.out.println("Το κράτος κατάφερε να καλύψει τα έξοδά του με "
            +" τα έσοδά του εξαιρούμενων των τόκων πολύ αποδοτικά! " 
                + " Συγχαρητήρια"
            );
        } else {
            System.out.println("Καλή επίδοση. Το κράτος κάλυψε τα έξοδά του"
                + " με τα έσοδα που είχε σε αποδεκτό βαθμό."
            );
        }
    }
}