public class GradeChar {

    public void gdpGrowthChar(int g) {
        if (g == 5) {
            System.out.println("Το ΑΕΠ μειώθηκε! Πρέπει να "
                + " γίνουν ενέργειες για την επαναφορά της ανάπτυξής του "
                + " το νέο έτος" 
            );
        } else if (g == 6) {
            System.out.println("Πολύ μικρή αύξηση του ΑΕΠ! Πρέπει την "
            + "επόμενη χρονιά να αυξηθεί ο ρυθμός μεγένθυσης!"
            );
        } else if (g >= 9) {
            System.out.println("Μεγάλη άυξηση του ΑΕΠ! Η εγχώρια οικονομία" 
                + " αναπτύσσεται με γρήγορο ρυθμό. Συγχαρητήρια"
            );
        } else {
            System.out.println("Καλή επίδοση. Το ΑΕΠ παρουσίασε αποδεκτή αύξηση.");
        }
    }

    public void surplusChar(int g) {
        if (g == 5) {
            System.out.println("Το πρωτογενές πλεόνασμα έχει αρνηρική τιμή." 
                + " Το κράτος δέν κατάφερε να καλύχει τα έξοδά του με τα έσοδα!"
                + " Πρέπει να γίνει πιο υπεύθυνη κατανομή και διάθεση των "
                + "πόρων την νέα χρονιά!"
            );
        } else if (g == 6) {
            System.out.println("Μικρό πρωτογενές πλεόνασμα. Πρέπει να γίνουν "
                + "ενέργειες για την αύξησή του "
            );
        } else if (g >= 9) {
            System.out.println("Το κράτος κατάφερε να καλύψει τα έξοδά του με "
            +" τα έσοδά του εξαιρούμενων των τόκων πολύ αποδοτικά! " 
                + " Συγχαρητήρια"
            );
        } else {
            System.out.println("Καλή επίδοση. Το κράτος κάλυψε τα έξοδά του"
                + " με τα έσοδα που είχε σε αποδεκτό βαθμό."
            );
        }
    }
    public void giniChar(int g) {
         if (g <= 6) {
            System.out.println("Υπάρχουν μεγάλες εισοδηματικέςσ ανισότητες"
                + " εντός του πλυθησμού! Πρέπει να γίνουν ενέργειες " 
                + "για να κατανεμηθεί πιο δίκαια το συνολικό εισόδημα "
                + "στην κοινωνία!"
                );
        } else if (g >= 9) {
            System.out.println("Οι εισοδηματικές ανισότητες έχουν "
                + "περιοριστεί! Πολύ καλή επίδοση!"
                ); 
        } else {
            System.out.println("Aποδεκτή επίδοση. Οι εισοδηματικές " 
                +"ανισότητες βρίσκονται σε επιτρεπτό επίπεδο."
            );
        }
    }
    public void crimeRateChar(int g) {
        if (g <= 6) {
            System.out.println("Μεγάλη αύξηση της εγκληματικότητας! "
                + "Πρέπει να γίνουν ενέργειες για τον περιορισμό της"
            );
        } else if (g >= 9) {
            System.out.println("H εγκληματικότητα μειώθηκε σημαντικά! "
                + "Πολύ καλή επίδοση. Συγχαρητήρια!"
            );
        } else {
            System.out.println("Οι μεταβολές της εγκληματικότητας βρίσκονται "
               + "εντός των επιτρεπτών ορίων."
            );
        }
    }

    public void edHealthChar(int g) {
        if (g <= 6) {
            System.out.println("Oι δαπάνες στην υγεία και την παιδεία "
                + "είναι αρκετά χαμηλές. Πρέπει να αυξηθούν! Υπάρχει " 
                + "δυσαρέσκεια στον πλυθησμό!"
            );
        } else if (g >= 9) {
            System.out.println("Γίνονται μεγάλες δαπάνες σε υγεία "
                + "και παιδεία! Οι πολίτες είναι ευχαριστημένοι!"
            );
        } else {
            System.out.println("Οι δαπάνες σε υγεία και παιδεία βρίσκονται "
                + "σε επιτρεπτό επίπεδο. Ίσως πρέπει να αυξηθούν για την "
                 + "ευρύτερη ικανοποίηση των πολιτών!"
            );
        }
    }

    public void resChar(int g) {
        if (g <= 6) {
            System.out.println("Το ποσοστό χρήσης των αμαμεώσιμων "
              + "πηγών ενέργειας είναι χαμηλό! Πρέπει να αυξηθεί."
            );
        } else if (g >= 9) {
            System.out.println("Οι ανανεώσιμες πηγές ενέργειας "
                + "αξιοποιήθηκαν σε πολύ μεγάλη κλίμακα! Συγχαρητήρια!"
            );
        } else {
            System.out.println("Η αξιοποίηση ανανεώσιμων πηγών ενέργειας "
            + " βρίσκεται σε αποδεκτό επίπεδο"
            );
        }
    }
    
    public void emmisionChar(int g) {
        if (g <= 6) {
            System.out.println("Οι ρύποι παρουσίασαν σημαντική αύξηση. "
                + " Πρέπει να γίνουν ενέργειες για την μείωσή τους ώστε να"
                + " πετύχουμε τους μακροπρόθεσμους περιβαλλοντικούς μασ στόχους!"
            );
        } else if (g >= 9) {
            System.out.println("Αξιοσημείωτη μείωση στους ρύπους! Συγχαρητήρια."
            );
        } else if (g == 8) {
            System.out.println("Μικρή μείωση των ρύπων. Καλή επίδοση με βάση"
            + " τους μακροπρόθεσμους στόχους."
            );
        } else {
            s
            System.out.println("Μικρή αύξηση στους ρύπους. Μπορούν να γίνουν "
                + "ενέργειες για να φτάσουμε στην μείωση!"
            )
        }
    }

}
